#Дан список, который включает числа от 1 до 9. Требуется выяснить, сколько значений попало в диапазон  от 1 до 3, от 4 до 6, от 7 до 9.
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
d1 = 0
d2 = 0
d3 = 0
for number in numbers:
    if 1 <= number <= 3:
        d1 += 1
    elif 4 <= number <= 6:
        d2 += 1
    elif 7 <= number <= 9:
        d3 += 1
print(d1, d2, d3)









