#Дан файл с расписанием занятий на неделю.
#Помимо названия предмета в нем также указано лекция это, практическое занятие, или лабораторная работа.
#В одной строке может быть указан только один предмет с информацией о нем. 
#Посчитать, сколько за неделю проходит практических занятий, лекций и лабораторных работ отдельно по каждому предмету.

file =  open('Labs/Laba10/EXC6/input.txt', 'r')



file = open('Labs/Laba10/EXC6/output.txt', 'w')
file.write()

print(file)
file.close()